{
  "backend/main.mo": "Motoko backend actor implementing user-specific notes (CRUD operations) and break reminder functionality with time-based notifications, using Maps for storage and a Queue for notification management.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: Internet Identity login flow, notes CRUD operations, and break reminder functionality with their associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 14 frontend files covering the landing page, React Query hooks, overlay components, panels, content scripts, and build configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for the companion dog UI.",
  "frontend/index.html": "Minimal HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/public/manifest.json": "Chrome extension manifest v3 configuration defining permissions, content scripts, web-accessible resources, and metadata for the Companion Dog extension.",
  "frontend/scripts/build-extension.js": "Node.js build script that copies manifest, assets, and creates a placeholder content.js, then packages everything into a zip file for extension distribution.",
  "frontend/src/App.tsx": "Landing page component with Internet Identity login/logout, extension download functionality, feature descriptions, and installation instructions with warm amber/orange theming.",
  "frontend/src/content/BreakNotification.tsx": "Full-screen modal component displaying a break reminder notification with snooze and dismiss buttons, styled with green/emerald gradient theme.",
  "frontend/src/content/BreakReminderPanel.tsx": "React component that renders a panel for configuring break reminder intervals (in minutes), saving the setting to backend and localStorage, with error and success feedback.",
  "frontend/src/content/content.tsx": "Content script entry point that creates a shadow DOM container, injects styles, and renders the DogOverlay app with QueryClient and InternetIdentityProvider.",
  "frontend/src/content/DogOverlay.tsx": "Main draggable dog companion overlay component that manages state (position, dog animations, messages, panels), handles authentication, displays random encouraging messages, and shows break notifications from the backend.",
  "frontend/src/content/InteractionButtons.tsx": "Renders four circular gradient buttons (Feed, Pet, Notes, Break Reminder) with icons that trigger callback functions passed as props.",
  "frontend/src/content/MessageBubble.tsx": "Simple presentational component that displays a message in a styled speech bubble with a tail pointer, positioned above the dog.",
  "frontend/src/content/messages.ts": "Exports an array of 20 encouraging messages and a helper function to randomly select one for display.",
  "frontend/src/content/NotesPanel.tsx": "Panel component for creating, editing, and deleting notes using backend queries, with inline editing, error handling, and a scrollable list view.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, switching between authenticated and anonymous actors based on Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on notes (fetch, create, edit, delete) and managing break reminders and notifications through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using OKLCH color space, font imports (Nunito, Quicksand), and animation utilities for fade-in, slide-in, and zoom effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom fonts (Nunito, Quicksand), OKLCH-based color system, border radius variables, and accordion animations using typography and container query plugins.",
  "project_state.json": "Project metadata describing a browser extension with dog companion overlay featuring encouragement messages, interactions, note-taking, and break reminders, with a known login flow issue."
}