{
  "backend/main.mo": "Motoko actor implementing a note-taking system with CRUD operations and break reminder functionality, storing user-specific notes and reminders with timestamp tracking and notification queue management.",
  "feature_evidence.json": "Feature evidence report documenting the Internet Identity login blank page bug fix in the browser extension content script, linking manifest.json and content script files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including React components, hooks, content scripts, and configuration files for the Companion Dog browser extension.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for the companion dog UI.",
  "frontend/index.html": "Minimal HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/public/manifest.json": "Chrome extension manifest v3 configuration with permissions, host permissions for IC domains, content scripts, web accessible resources, and CSP for Internet Identity authentication.",
  "frontend/scripts/build-extension.js": "Node.js build script that copies manifest, assets, and creates a placeholder content.js, then packages everything into a zip file for extension distribution.",
  "frontend/src/App.tsx": "Landing page React component with Internet Identity login, extension download functionality, feature descriptions, and installation instructions for the Companion Dog browser extension.",
  "frontend/src/content/BreakNotification.tsx": "Full-screen modal component displaying break reminder notifications with snooze and dismiss buttons, styled with green theme and coffee icon.",
  "frontend/src/content/BreakReminderPanel.tsx": "Settings panel component for configuring break reminder intervals with local storage persistence, error handling, success feedback, and loading states.",
  "frontend/src/content/content.tsx": "Content script entry point that creates a shadow DOM container, injects styles, and renders the DogOverlay with QueryClient and InternetIdentity providers.",
  "frontend/src/content/DogOverlay.tsx": "Main component for the draggable dog companion overlay that manages state for position, animations, authentication, notes panel, break reminders, and displays random encouraging messages.",
  "frontend/src/content/InteractionButtons.tsx": "Renders four circular gradient buttons (feed, pet, notes, break reminder) with icons and hover effects for interacting with the dog companion.",
  "frontend/src/content/MessageBubble.tsx": "Displays a speech bubble above the dog with animated entrance effects showing encouraging messages or notifications.",
  "frontend/src/content/messages.ts": "Exports an array of 20 encouraging messages and a helper function to randomly select one for display.",
  "frontend/src/content/NotesPanel.tsx": "Panel component for creating, editing, and deleting user notes with error handling, using React Query hooks for backend synchronization.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on notes (useNotes, useCreateNote, useEditNote, useDeleteNote) and hooks for break reminder management (useSetBreakReminder, useProcessNotifications), all using the actor from useActor hook.",
  "frontend/src/index.css": "Defines global CSS with Tailwind directives, custom CSS variables for light/dark themes using OKLCH color space, font imports (Nunito and Quicksand), and custom animation utilities (fadeIn, slideInFromBottom, zoomIn).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom fonts (Nunito, Quicksand), OKLCH-based color system, custom border radius values, shadows, and accordion animations, plus typography and container-queries plugins.",
  "project_state.json": "Project metadata describing a browser extension with dog companion overlay featuring encouragement messages, feeding/petting interactions, note-taking, and break reminders, built with Manifest V3 and packaged as a Chrome extension."
}